Test/TrimFuel.WebServices.Test/DirectActionSOAP_Sub.txt

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<CreateSubscription xmlns="http://trianglecrm.com/">
<username>directaction</username>
<password>dew9JKq2az</password>
<chargeForTrial>true</chargeForTrial>
<planID>358</planID>
<firstName>Test</firstName>
<lastName>Test</lastName>
<address1>Test</address1>
<address2></address2>
<city>Test</city>
<state>CA</state>
<zip>00000</zip>
<phone>00000000</phone>
<email>dtcoder@gmail.com</email>
<ip>64.34.233.18</ip>
<affiliate></affiliate>
<subAffiliate></subAffiliate>
<internalID></internalID>
<paymentType>2</paymentType>
<creditCard>4111111111111111</creditCard>
<cvv>000</cvv>
<expMonth>02</expMonth>
<expYear>2014</expYear>
</CreateSubscription>
</soap:Body>
</soap:Envelope>